app/views/OWS/Availability/FetchExpectedChargesRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:ava="http://webservices.micros.com/ows/5.1/Availability.wsdl" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/">
    <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ava:FetchExpectedChargesRequest>
         <ava:HotelReference chainCode="{chainCode}" hotelCode="{hotelCode}"></ava:HotelReference>
         <ava:StayDateRange>
            <hot:StartDate>{StartDate}</hot:StartDate>
            <hot:EndDate>{EndDate}</hot:EndDate>
         </ava:StayDateRange>
         <ava:GuestCount>
            <hot:GuestCount ageQualifyingCode="ADULT" count="{totalNumberOfGuests}"/>
         </ava:GuestCount>
         <ava:RatePlanCode>{ratePlanCode}</ava:RatePlanCode>
         <ava:RoomTypeCode>{roomTypeCode}</ava:RoomTypeCode>
         <ava:NumberOfRooms>{numberOfRooms}</ava:NumberOfRooms>
      </ava:FetchExpectedChargesRequest>
   </soapenv:Body>
</soapenv:Envelope>